1、查看手册
	man ls
	man [1~9] ls
   查看帮助
	ls --help

2、切换虚拟目录
	cd	切换到用户主目录
	cd /usr/bin

3、显示当前工作目录
	pwd

4、显示当前目录下的文件和目录
	ls
	ls my_script 只显示该文件信息
	ls my_scr?pt 问号代表一个字符
	ls my_scr*pt 星号代表零个或多个字符
	ls my_scr[ai]pt 表示a或i
	ls my_scr[a-i]pt 表示a至i
	ls my_scr[!a]pt 表示排除是a的

		-l 长列表显示附加信息	
		-a 显示隐藏文件
		-F 区分文件和目录，带*的是可执行文件
		-R 递归列出当前目录包含的子目录中的文件
		-i 显示文件的inode编号
		-d 只列出目录本身信息，不列出其中的内容
		--time=atime 展示访问时间而非修改时间

		-rwxrwxr-x    1          chen   chen   8296      7月   9 09:15  demo*
		类型|权限     硬链接总数  用户名 组名   字节大小   修改时间	文件或目录名

5、文件不存在创建或存在则改变修改时间
	touch test
		-a 只改访问时间不改修改时间

6、复制文件,有新的修改时间
	cp test1 test2 当前目录复制出test2
	cp test1 /home/chen/Downloads/ 复制到指定目录Downloads中,注意最后要加/
		-i 强制shell询问是否覆盖已有文件
		-R 递归复制整个目录，目的文件不存在还会自动创建，如cp -R Desktop/ ./Downloads/AAA 会自动创建AAA目录

7、链接文件
	ln file linkFile
		-s 创建符号链接

8、重命名或移动文件和目录，inode和 时间戳不变
	mv test1 test2 将test1改名为test2
	mv test1 Downloads/ 将test1文件移动到Downloads目录
	mv Desktop/ Downloads/ 将Desktop整个目录移动到Downloads目录下
	mv test1 Downloads/test2 将test1移动到Downloads目录，并改名为test2
		-i 强制shell询问是否覆盖已有文件

9、删除文件
	rm f?ll 删除所有匹配文件
		-i shell询问是否确定删除
		-f 不询问强制删除
		-r 递归删除整个目录，当删除目录时，必须加该选项
-----------------------------------------------------------------------------
10、创建目录
	mkdir newDir
		-p创建多级目录

11、删除目录（也可以rm）
	rmdir newDir 只能删除空目录
-----------------------------------------------------------------------------
12、查看文件类型
	file test 查看是文本、目录、脚本、二进制

13、查看整个文件
	cat test 显示全部内容
		-n 加行号
		-b 只能有文本的行加行号
		-T 使用^I代替制表符

	more test 分页查看

	less test 支持前后翻动、高级搜索、支持上下键和上下翻页键

14、查看部分文件
	tail test 默认显示最后10行内容
		-n 指定显示最后n行
		-f 实时监控文件变化

	head test 默认显示前10行内容
		-n 指定显示前n行

-----------------------------------------------------------------------------
15、查看进程
	ps 只显示运行在当前控制台下属于当前用户的进程
		-e 显示所有进程(Unix风格)
		-f 显示完整格式输出(Unix风格)
		-l 显示长列表(Unix风格)

		 l 显示长模式(BSD风格)，其中的STAT比较有用 

		--forest 层级结构显示出和父进程的层级关系(GNU风格)

F	  S		UID        	PID  	PPID  		C 			STIME 		TTY          		TIME 			CMD
4 	  S		root         	2     	0  		0 			03:39 		?       	 	00:00:00 		[kthreadd]
系统标记  进程状态	启动进程的用户	进程ID	父进程ID	声明周期中CPU利用率	启动时系统时间	启动时的终端设备	累计的CPU时间 		程序名称
（进程状态：O正在运行；S休眠；R可运行，正在等待；Z僵化，进程已结束但父进程已不存在；T停止）

16、实时查看进程
	top 按照%CPU值进行排序，交互命令f改变排序字段、d修改轮询间隔、q退出

	top - 07:31:13 up  3:52,  1 user,  load average: 0.20, 0.21, 0.16			当前时间、系统运行时间、登录用户数、系统的平均负载：最近1分钟、5分钟、15分钟，值越大负载越高
	Tasks: 249 total,   1 running, 195 sleeping,   0 stopped,   1 zombie			任务（进程）总数、运行、休眠、停止、僵化的数量
	%Cpu(s):  3.4 us,  1.5 sy,  0.0 ni, 94.7 id,  0.2 wa,  0.0 hi,  0.2 si,  0.0 st		CPU概要，用户利用率，系统利用率
	KiB Mem :  8104532 total,   800004 free,  2025388 used,  5279140 buff/cache		系统物理内存总量、空闲总量、使用总量
	KiB Swap:  7999484 total,  7998960 free,      524 used.  5638100 avail Mem 		交换空间内存总量、空闲总量、使用总量
	
	PID 	USER      PR  		NI    	VIRT    	RES    		SHR	 		S  	%CPU	 	%MEM     		TIME+ 		COMMAND 		
	1424 	chen      20   		0 	4697444 	409600 		144148 			S  	 9.3 	 	5.1  			19:06.93 	gnome-shell  
			进程优先级   谦让度值  占用虚拟内存总量  占用物理内存总量 和其他进程共享的内存总量  状态  使用CPU时间比例   使用内存占可用内存比例    CPU时间总量	

17、结束进程
	kill 3940 发送一个TERM（15尽可能终止）信号，必须是进程的属主或root用户
		-s 名称 使用名称
		-9 	使用信号名

	killall http* 通过进程名来结束进程

-----------------------------------------------------------------------------
18、挂载存储媒体
	mount 输出当前系统上挂载的设备列表


-----------------------------------------------------------------------------


-----------------------------------------------------------------------------

-----------------------------------------------------------------------------


-----------------------------------------------------------------------------


-----------------------------------------------------------------------------


-----------------------------------------------------------------------------

-----------------------------------------------------------------------------
-----------------------------------------------------------------------------
-----------------------------------------------------------------------------
-----------------------------------------------------------------------------
-----------------------------------------------------------------------------
-----------------------------------------------------------------------------
-----------------------------------------------------------------------------
-----------------------------------------------------------------------------
-----------------------------------------------------------------------------
-----------------------------------------------------------------------------










































